import Image from 'next/image';
import styles from './hospital.module.css';

const Hospital = () => {
    return (
        <div className={styles.wrap}>
            <Image src={'/hospital.jpg'} width={1000} height={1000} alt='hospital' />
            <div className={styles.content}>
                <section className={styles.head}>
                    <h1>
                        Стаціонар: післяопераційний та інфекційний догляд
                        у Центрі Ветеринарної Медицини на Разумовській
                    </h1>
                    <p>
                        У складні моменти, коли ваш улюбленець потребує тривалого нагляду після
                        операції або під час серйозного інфекційного захворювання, надзвичайно
                        важливо забезпечити йому комфортні та безпечні умови для одужання.
                        Саме для цього в нашому <strong>Центрі Ветеринарної Медицини на Разумовській</strong>
                        функціонує стаціонар, розділений на <b>післяопераційне</b> та <b>інфекційне</b> відділення.
                    </p>
                </section>
                <section className={styles.needlessness}>
                    <h2>Навіщо потрібен стаціонар?</h2>
                    <p>
                        Не всі клінічні випадки дозволяють обмежитися лише амбулаторним лікуванням.
                        Після складних хірургічних втручань, при важких інфекційних хворобах або
                        загрозливих станах життєво важливо залишити тварину під
                        цілодобовим ветеринарним наглядом. Це дає змогу контролювати динаміку,
                        швидко реагувати на зміни стану, проводити інфузії, знеболення,
                        антибіотикотерапію, кисневу підтримку тощо.
                    </p>
                </section>
                <section className={styles.postoperative}>
                    <h2>Післяопераційний догляд</h2>
                    <p>
                        Після оперативного втручання організм тварини є вразливим. <br />
                        У нашому стаціонарі:
                    </p>

                    <ul>
                        <li>Забезпечено тепловий комфорт і спокій, необхідний для якнайшвидшого відновлення;</li>
                        <li>Постійно контролюються температура, пульс, дихання, рівень знеболення;</li>
                        <li>Проводиться інфузійна терапія (крапельниці), антибіотикопрофілактика, моніторинг швів;</li>
                        <li>Забезпечується індивідуальний раціон, за потреби — через зонд або шприцеве годування;</li>
                        <li>У разі ускладнень або болю тварина не залишається одна, лікарі оперативно втручаються.</li>
                    </ul>
                </section>
                <section className={styles.infectious}>
                    <div className={styles.infectious__head}>
                        <h2>Інфекційне відділення</h2>
                        <p>
                            Тварини з вірусними або бактеріальними інфекціями перебувають в окремому
                            ізольованому боксі, що повністю відповідає ветеринарним санітарним нормам.
                        </p>
                    </div>
                    <ul>
                        <li>Дотримано строгий протиепідемічний режим: дезінфекція, окремий інструментарій, засоби індивідуального захисту;</li>
                        <li>Лікування проводиться згідно з оновленими протоколами, з урахуванням результатів аналізів;</li>
                        <li>Регулярно проводиться заміна постільного матеріалу, санітарна обробка, контроль параметрів організму;</li>
                        <li>Власники можуть отримувати фото та відео-звіти про стан пацієнта.</li>
                    </ul>
                </section>
                <section className={styles.comfort}>
                    <h2>Комфорт для тварин і спокій для власників</h2>
                    <p>
                        Наші ветеринари уважні до кожного пацієнта. Умови стаціонару адаптовані
                        під різні види тварин (кішки, собаки, гризуни), з урахуванням їхніх психологічних
                        особливостей:
                    </p>
                    <ul>
                        <li>Окремі клітки з утепленими підстилками;</li>
                        <li>Тиха атмосфера, яка зменшує рівень стресу;</li>
                        <li>Можливість принести власну підстилку або іграшку тварини;</li>
                        <li>Щоденний зв'язок із власником, надання порад з реабілітації.</li>
                    </ul>
                </section>
                <section className={styles.schedule}>
                    <h2>Графік роботи стаціонару</h2>
                    <span>🕘 Стаціонар працює щоденно з 9:00 до 17:00.</span>
                    <p>
                        У випадках, коли пацієнт потребує інтенсивної нічної терапії
                        або реанімаційних заходів, клініка пропонує виклик чергового
                        лікаря-реаніматолога, який може залишитися з твариною на ніч
                        (послуга оплачується додатково)
                    </p>
                </section>
                <section className={styles.prices}>
                    <h2>Ціни на стаціонар:</h2>
                    <ul>
                        <li>Стаціонарне утримання кіт<span>300грн</span></li>
                        <li>Собаки (залежно від ваги) <span>300-700грн</span></li>
                        <li>Екзотичні тварини <span>уточнювати</span></li>
                    </ul>
                </section>
                <p className={styles.banner}>
                    У «Центрі Ветеринарної Медицини на Разумовській» ви можете бути
                    впевнені, що ваш улюбленець у надійних руках. Ми не просто лікуємо
                    — ми супроводжуємо, підтримуємо і захищаємо, на кожному етапі його одужання.
                </p>
            </div>
        </div>
    )
}

export default Hospital;