import Image from 'next/image';
import styles from './neurology.module.css';

const Neurology = () => {

    const paw = (<svg height="50" viewBox="0 0 512 512" width="30">
        <title />
        <path d="M490.39,182.75c-5.55-13.19-14.77-22.7-26.67-27.49l-.16-.06a46.46,46.46,0,0,0-17-3.2h-.64c-27.24.41-55.05,23.56-69.19,57.61-10.37,24.9-11.56,51.68-3.18,71.64,5.54,13.2,14.78,22.71,26.73,27.5l.13.05a46.53,46.53,0,0,0,17,3.2c27.5,0,55.6-23.15,70-57.65C497.65,229.48,498.78,202.72,490.39,182.75Z" />
        <path d="M381.55,329.61c-15.71-9.44-30.56-18.37-40.26-34.41C314.53,250.8,298.37,224,256,224s-58.57,26.8-85.39,71.2c-9.72,16.06-24.6,25-40.36,34.48-18.07,10.86-36.74,22.08-44.8,44.16a66.93,66.93,0,0,0-4.65,25c0,35.95,28,65.2,62.4,65.2,17.75,0,36.64-6.15,56.63-12.66,19.22-6.26,39.09-12.73,56.27-12.73s37,6.47,56.15,12.73C332.2,457.85,351,464,368.8,464c34.35,0,62.3-29.25,62.3-65.2a67,67,0,0,0-4.75-25C418.29,351.7,399.61,340.47,381.55,329.61Z" />
        <path d="M150,188.85c11.9,14.93,27,23.15,42.52,23.15a42.88,42.88,0,0,0,6.33-.47c32.37-4.76,52.54-44.26,45.92-90C242,102.3,234.6,84.39,224,71.11,212.12,56.21,197,48,181.49,48a42.88,42.88,0,0,0-6.33.47c-32.37,4.76-52.54,44.26-45.92,90C132,157.67,139.4,175.56,150,188.85Z" />
        <path d="M313.16,211.53a42.88,42.88,0,0,0,6.33.47c15.53,0,30.62-8.22,42.52-23.15,10.59-13.29,17.95-31.18,20.75-50.4h0c6.62-45.72-13.55-85.22-45.92-90a42.88,42.88,0,0,0-6.33-.47C315,48,299.88,56.21,288,71.11c-10.6,13.28-18,31.19-20.76,50.44C260.62,167.27,280.79,206.77,313.16,211.53Z" />
        <path d="M111.59,308.8l.14-.05c11.93-4.79,21.16-14.29,26.69-27.48,8.38-20,7.2-46.75-3.15-71.65C120.94,175.16,92.85,152,65.38,152a46.4,46.4,0,0,0-17,3.2l-.14.05C36.34,160,27.11,169.54,21.58,182.73c-8.38,20-7.2,46.75,3.15,71.65C39.06,288.84,67.15,312,94.62,312A46.4,46.4,0,0,0,111.59,308.8Z" />
    </svg>);
    const svgMarker = (<svg width="16" height="16" viewBox="0 0 16 16" fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path d="M13.3346 4L6.0013 11.3333L2.66797 8" stroke="currentColor"
            strokeWidth="2" strokeLinecap="round" strokeLinejoin="round">
        </path>
    </svg>);

    return (
        <div className={styles.wrap}>
            <Image src={"/neurology.jpg"} width={1000} height={600} alt='Neurology' />
            <div className={styles.content}>
                <section className={styles.head}>
                    <h1>Неврологія у ветеринарній медицині</h1>
                    <b>Коли здоров’я нервової системи тварини потребує особливої уваги</b>
                    <p>
                        Неврологія — це один з найскладніших, але водночас найважливіших
                        напрямів у ветеринарії. Захворювання нервової системи у тварин можуть
                        проявлятися дуже різноманітно — від незначної тремтливості чи хиткої
                        ходи до повного паралічу, судом або змін у поведінці. Саме тому
                        надзвичайно важливо вчасно звернутися до ветеринарного невролога
                        для встановлення точного діагнозу і призначення ефективного лікування.
                    </p>
                    <p>
                        У ветеринарній клініці на Розумовській ми надаємо повноцінну
                        неврологічну допомогу — від первинної консультації до тривалого
                        ведення пацієнтів із хронічними або тяжкими станами.
                    </p>
                </section>
                <hr />
                <section className={styles.about}>
                    <div className={styles.about__head}>
                        <h2>Що лікує ветеринарний невролог?</h2>
                        <p>
                            Ветеринарна неврологія охоплює широкий спектр патологій
                            центральної (головний і спинний мозок) та периферичної
                            (нерви, м’язи) нервової системи.
                        </p>
                        <span><b>До таких належать:</b></span>

                    </div>
                    <div className={styles.about__list}>
                        <ul>
                            <li>{svgMarker}Епілепсія та судомні стани;</li>
                            <li>{svgMarker}Вестибулярні розлади (запаморочення, нахил голови, втрата координації);</li>
                            <li>{svgMarker}Паралічі та парези кінцівок;</li>
                            <li>{svgMarker}Захворювання міжхребцевих дисків (грижі, протрузії);</li>
                            <li>{svgMarker}Пухлини головного або спинного мозку;</li>
                            <li>{svgMarker}Вроджені аномалії (гідроцефалія, синдром Киарі тощо);</li>
                            <li>{svgMarker}Невропатії, поліневрити, міастенія;</li>
                            <li>{svgMarker}Інфекційні ураження нервової системи (чума, токсоплазмоз, лептоспіроз, бабезіоз);</li>
                            <li>{svgMarker}Наслідки травм (ДТП, падіння, удари).</li>
                        </ul>
                    </div>
                </section>
                <section className={styles.patology}>
                    <h2>Коли варто звертатися до ветеринарного невролога?</h2>
                    <p>
                        <b>
                            Будь-які незвичні рухи, порушення поведінки або функцій організму
                            можуть свідчити про неврологічну патологію. Не відкладайте візит
                            до лікаря, якщо у вашої тварини:
                        </b>
                    </p>
                    <ul>
                        <li>Тремор, судоми, мимовільні рухи;</li>
                        <li>Перекошене обличчя, асиметрія голови;</li>
                        <li>Втрата координації, нестійка хода;</li>
                        <li>Слабкість або повна відсутність рухів у кінцівках;</li>
                        <li>Часті спотикання або завалювання на бік;</li>
                        <li>Постійне облизування, кусання, вокалізація без причини;</li>
                        <li>Різкі зміни поведінки: агресія, апатія, дезорієнтація;</li>
                        <li>Порушення зору, слуху, нюху;</li>
                        <li>Проблеми з сечовипусканням або дефекацією.</li>
                    </ul>
                </section>
                <hr />
                <section className={styles.diagnostics}>
                    <div className={styles.diagnostics__content}>
                        <h2>Як проходить неврологічне обстеження в нашій клініці?</h2>
                        <p><b>Неврологічна діагностика — це комплексний процес, що включає:</b></p>
                        <ul>
                            <li><span>1</span> Детальний збір анамнезу — важлива частина, яка дозволяє зрозуміти динаміку симптомів;</li>
                            <li><span>2</span> Неврологічний огляд — оцінка тонусу м’язів, координації, рефлексів, больової чутливості;</li>
                            <li><span>3</span> Аналіз крові та сечі, щоб виключити метаболічні причини;</li>
                            <li><span>4</span> УЗД або рентген (для виключення структурних патологій);</li>
                            <li><span>5</span> Направлення на МРТ або КТ у спеціалізовані діагностичні центри — з повним супроводом, анестезією та поверненням пацієнта;</li>
                            <li><span>6</span> Електроміографія (EMG) або інші вузькопрофільні тести — при підозрі на м’язові або нервові порушення.</li>
                        </ul>
                    </div>
                    <Image src={"/neurology2.jpg"} width={600} height={600} alt='Neurology' />
                </section>
                <hr />
                <section className={styles.treatment}>
                    <h2>Лікування неврологічних захворювань</h2>
                    <span>
                        У клініці на Розумовській ми підбираємо індивідуальний підхід
                        до кожного пацієнта, враховуючи тип та важкість ураження:
                    </span>
                    <ul>
                        <li>
                            {paw}
                            <p>Медикаментозна терапія — знеболення, протисудомні препарати, протизапальні засоби;</p>
                        </li>
                        <li>
                            {paw}
                            <p>Хірургічне лікування — при міжхребцевих грижах, пухлинах (після діагностики);</p>
                        </li>
                        <li>
                            {paw}
                            <p>Фізіотерапія, реабілітація, масажі, кінезіотерапія — для відновлення рухових функцій;</p>
                        </li>
                        <li>
                            {paw}
                            <p>Довготривале ведення тварин з хронічними розладами;</p>
                        </li>
                        <li>
                            {paw}
                            <p>Паліативна допомога в складних випадках — забезпечення гідної якості життя.</p>
                        </li>
                    </ul>
                </section>
                <section className={styles.prices}>
                    <h2>Ціни на деякі діагностичні маніпуляції:</h2>
                    <ul>
                        <li>Первинний прийом лікаря-невролога<span>600грн</span></li>
                        <li>Рентген (1проекція)<span>300грн</span></li>
                        <li>УЗД абдомінальне<span>950грн</span></li>
                        <li>БХ аналіз крові<span>500грн</span></li>
                        <li>Загальний аналіз крові (ЗАК)<span>200грн</span></li>
                        <li>МРТ або КТ<span>уточнювати</span></li>
                        <li>Забор крові (один аналіз)<span>100грн</span></li>
                        <li>Витратні матеріали<span>50грн</span></li>
                    </ul>
                </section>
                <section className={styles.banner}>
                    <p>
                        Неврологічні захворювання — складні, але не безнадійні. Раннє звернення до спеціаліста
                        та правильно підібране лікування здатні повернути вашій тварині радість руху,
                        стабільний стан і звичний ритм життя. Ми готові пройти цей шлях разом із вами
                        — від діагностики до підтримки в найскладніших випадках.
                    </p>
                </section>
            </div>
        </div>
    )
}

export default Neurology;