import Image from 'next/image';
import styles from './laboratory.module.css';

const Laboratory = () => {
    return (
        <div className={styles.wrap}>
            <Image src={'/laboratory.jpg'} width={1000} height={600} alt='laboratory' />
            <div className={styles.content}>
                <section className={styles.head}>
                    <h1>Лабораторні дослідження у «Центрі ветеринарної медицини на Розумовській»</h1>
                    <p>
                        Своєчасна та точна діагностика — ключ до ефективного лікування.
                        У «Центрі ветеринарної медицини на Розумовській» ми приділяємо особливу увагу
                        лабораторним дослідженням як невід'ємній частині комплексного підходу до здоров'я
                        тварин. Наша сучасна ветеринарна лабораторія дозволяє швидко та достовірно виявляти
                        патології, оцінювати загальний стан організму та стежити за динамікою лікування.
                    </p>
                </section>
                <hr />
                <section className={styles.timing}>
                    <h2>Коли варто зробити аналіз?</h2>
                    <ul>
                        <li>Перед вакцинацією чи хірургічним втручанням</li>
                        <li>При симптомах нездужання (млявість, втрата апетиту, зміна поведінки)</li>
                        <li>У випадках тривалої діареї, кашлю, блювання</li>
                        <li>Для контролю лікування хронічних хвороб</li>
                        <li>Як частину щорічного профілактичного огляду</li>
                    </ul>
                </section>
                <section className={styles.menu}>
                    <h2>Які аналізи ми проводимо?</h2>
                    <ul className={styles.menu__list}>
                        <li className={styles.menu__list__li}>
                            <h3>Загальний аналіз крові (ОАК)</h3>
                            <p>
                                ОАК дозволяє оцінити основні параметри крові — рівень еритроцитів, лейкоцитів,
                                гемоглобіну, тромбоцитів. Це перше дослідження, яке призначається при підозрі
                                на запалення, анемію, інфекції чи інтоксикації.
                            </p>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Біохімічний аналіз крові (БХ)</h3>
                            <p>
                                Біохімія крові — один з найважливіших методів діагностики внутрішніх органів.
                                Ми визначаємо показники функції печінки, нирок, підшлункової залози, рівень
                                глюкози, білків, електролітів тощо.
                            </p>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Експрес-тести на вірусні інфекції</h3>
                            <p>У нашій лабораторії можна швидко виявити наявність поширених вірусів, таких як:</p>
                            <ul>
                                <li>Панлейкопенія, кальцівіроз, ринотрахеїт у котів;</li>
                                <li>Парвовірусний ентерит, чума у собак;</li>
                                <li>Вірус лейкозу (FeLV) та імунодефіциту (FIV) у котів.</li>
                            </ul>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Діагностика на бабезіоз</h3>
                            <p>
                                Ми проводимо мазки крові на бабезій — паразитів, які руйнують еритроцити
                                і викликають тяжку анемію та інтоксикацію. Аналіз дозволяє швидко виявити
                                захворювання на ранніх стадіях та почати лікування без зволікань.
                            </p>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Аналіз для визначення готовності до в’язки</h3>
                            <p>
                                Цей тест дозволяє встановити оптимальний час для парування тварин.
                                Особливо важливо для професійних заводчиків.
                            </p>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Загальний аналіз сечі (ОАМ)</h3>
                            <p>
                                Дослідження сечі допомагає виявити захворювання сечовивідної системи,
                                зокрема запалення, інфекції, наявність кристалів, білка, крові чи цукру.
                            </p>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Аналіз калу на яйця гельмінтів (я/г)</h3>
                            <p>
                                Визначення паразитарної інвазії — важлива частина профілактичного огляду.
                                Ми досліджуємо зразки калу під мікроскопом та виявляємо яйця гельмінтів,
                                цисти найпростіших та інші патології.
                            </p>
                        </li>
                        <li className={styles.menu__list__li}>
                            <h3>Мазок на гемобартенельоз</h3>
                            <p>
                                Цей аналіз проводиться для діагностики гемопаразитарних інфекцій,
                                які викликають серйозні порушення кровотворення, особливо у котів.
                                Мазок вивчається під мікроскопом, що дозволяє швидко виявити збудника.
                            </p>
                        </li>

                    </ul>
                </section>
                <section className={styles.why_we}>
                    <h2>Чому варто звернутися саме до нас?</h2>
                    <ul>
                        <li>Швидкість: багато результатів доступні вже протягом 15–30 хвилин.</li>
                        <li>Достовірність: ми використовуємо якісні тести та реагенти від перевірених виробників.</li>
                        <li>Комплексний підхід: результати аналізів інтерпретує не лише лаборант, а й ветеринарний лікар, що дозволяє швидко приймати клінічні рішення.</li>
                        <li>Досвідчені спеціалісти: наша команда має глибокі знання у сфері лабораторної діагностики, паразитології, вірусології та клінічної медицини.</li>
                    </ul>
                </section>
                <article className={styles.prices}>
                    <h2>Ціни на хірургічні маніпуляції:</h2>
                    <ul>
                        <li>Прийом хірурга <span>500грн</span></li>
                        <li>Прийом головного лікаря <span>700грн</span></li>
                        <li>Кастрація кішки (з наркозом) <span>2000грн</span></li>
                        <li>Кастрація кота (з наркозом) <span>1200грн</span></li>
                    </ul>
                </article>
                <section className={styles.banner}>
                    <p>
                        Лабораторна діагностика — це не розкіш, а необхідність у сучасній ветеринарії.
                        Вона дозволяє виявити хворобу ще до появи явних клінічних симптомів.
                        Довірте здоров’я вашого улюбленця «Центру ветеринарної медицини на Розумовській»
                        — ми подбаємо про нього з максимальною увагою, точністю та турботою.
                    </p>
                </section>
            </div>
        </div>
    )
}

export default Laboratory;