export const specialists = [
    { name: 'Ушаков Олег Степанович', status: 'xірург, ортопед', speciality: 'Кандидат ветеринарних наук, хірург, ортопед, головний лікар', photo: '/o_s.jpg' },
    { name: 'Ушаков Федір Олегович', status: 'xірург, ортопед', speciality: 'хірургія, ортопедія', photo: '/F_O.jpg' },
    { name: 'Бойко Наталія Анатолієвна', status: 'лабораторна діагностика, терапія', speciality: 'терапія, дієтологія, дерматологія, акушерство, лабораторна діагностика', photo: '/nata.jpg' },
    { name: 'Цацуріна Катерина Євгеніївна', status: 'візуальна діагностика', speciality: 'абдомінальне ультразвукове дослідження', photo: '/ekaterina.jpg' },
    { name: 'Ожнакіна Ольга Володимирівна', status: 'анестезіолог', speciality: 'анестезіологія, реанімація та інтенсивна терапія', photo: '/olga.jpg' },
    { name: 'Ніколишина Олена Іванівна', status: 'терапевт', speciality: 'інтенсивна терапія', photo: '/e_i.jpg' },

]

export const allSpecialists = [
    ...specialists,
    { name: 'Пирожук Назар Ярославович', status: 'хірург, терапевт', speciality: 'хірургія, терапія, онкологія, анестезіологія', photo: '/nazar.jpg' },
    { name: 'Пірожук Владислав Ярославович', status: 'кардіолог, пульмонолог', speciality: 'кардіологія, пульмонологія, ведення і реанімація важких пацієнтів', photo: '/hirurgiya.jpg' },
    { name: 'Нікуліна Олена Олександрівна', status: 'інфекціоніст', speciality: 'ведення, догляд та реанімація стаціонарних пацієнтів', photo: '/avatar.jpg' },
    { name: 'Резніченко Марьяна Сергіївна', status: 'інтенсивна терапія', speciality: 'ведення, догляд та реанімація стаціонарних пацієнтів', photo: '/avatar.jpg' },
    { name: 'Войт Деніс Миколайович', status: 'рентгенолог', speciality: 'рентгенологія, інтенсивна терапія', photo: '/avatar.jpg' },
    { name: 'Скрєблюков Сергій Сергійович', status: 'терапевт', speciality: 'терапія, реанімація, супровод пацієнтів на МРТ та КТ', photo: '/avatar.jpg' },
    { name: 'Татарін Андрій Володимирович', status: 'терапевт', speciality: 'терапія, реанімація', photo: '/andrey_v.jpg' },
    { name: 'Просвєтова Ірина', status: 'лабораторна діагностика', speciality: 'лабораторна діагностика', photo: '/avatar.jpg' },
];