import Image from 'next/image';
import styles from './diagnostics-tbs.module.css';

const DiagnosticsTbs = () => {

    const svgMarker = (<svg width="16" height="16" viewBox="0 0 16 16" fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path d="M13.3346 4L6.0013 11.3333L2.66797 8" stroke="currentColor"
            strokeWidth="2" strokeLinecap="round" strokeLinejoin="round">
        </path>
    </svg>);

    return (
        <div className={styles.wrap}>
            <Image src={'/dog1.jpg'} width={1500} height={100} alt='dog1' />
            <div className={styles.content}>
                <div className={styles.head}>
                    <h1>Діагностика та оцінка дисплазії тазостегнових суглобів (ТБС)</h1>
                    <p>
                        У нашій ветеринарній клініці проводиться всебічна діагностика дисплазії
                        кульшових суглобів (HIP), що включає як клінічні тести, так і сучасні методи
                        візуалізації. Дослідження охоплює тест Ортолані з визначенням кута вправлення
                        (кут Ортолані), а також тест Барлоу (кут повторного вивиху), що доповнюється
                        рентгенографією кульшових суглобів у різних проекціях. Цю процедуру проводить
                        сертифікований експерт кінологічного об&apos;єднання – Ушаков Федір Олегович. В рамках
                        діагностики також можливе обстеження ліктьових суглобів.
                    </p>
                    <div className={styles.head__bottom}>
                        <h3>Діагностика проводится в цілях:</h3>
                        <ul>
                            <li>Забезпечення контролю та якості племінного розведення</li>
                            <li>Селекції особин з гарною анатомією суглобів</li>
                        </ul>
                    </div>
                </div>
                <article className={styles.recomendation}>
                    <div className={styles.recomendation_head}>
                        <h2>Кому рекомендовано обстеження?</h2>
                        <h3>Обстеження показане:</h3>
                    </div>
                    <div className={styles.recomendation_all_lists}>
                        <div>
                            <b>Усім собакам великих і гігантських порід:</b>
                            <ul>
                                <li>{svgMarker}У віці до 4 місяців;</li>
                                <li>{svgMarker}А також у віці від 12 до 18 місяців;</li>
                            </ul>
                        </div>
                        <div>
                            <b>Представникам будь-яких порід за наявності клінічних ознак:</b>
                            <ul>
                                <li>{svgMarker}Неправильне положення тазових кінцівок;</li>
                                <li>{svgMarker}Ускладнення при лежанні на животі з розведеними в сторони задніми лапами (поза &quot;жабки&quot;);</li>
                                <li>{svgMarker}Зниження рухової активності;</li>
                                <li>{svgMarker}Кульгавість, що посилюється після фізичних навантажень;</li>
                                <li>{svgMarker}Атипова хода: хиткість, &quot;стрибкоподібні&quot; рухи або &quot;заячий біг&quot; — одночасний поштовх обома задніми лапами;</li>
                                <li>{svgMarker}Труднощі при вставанні з положення лежачи;</li>
                                <li>{svgMarker}Неможливість стрибати;</li>
                                <li>{svgMarker}Проблеми зі спуском і підйомом сходами.</li>
                            </ul>
                        </div>
                        <div>
                            <b>Усім собакам, які плануються до племінної роботи:</b>
                            <ul>
                                <li>{svgMarker}Великі породи старше 12 місяців;</li>
                                <li>{svgMarker}Гігантські породи старше 18 місяців — згідно з регламентом FCI.</li>
                            </ul>
                        </div>
                    </div>
                </article>
                <section className={styles.note}>
                    <b>Важливо пам’ятати:</b> дисплазія кульшових суглобів може розвиватися у собаки в
                    будь-якому віці, і своєчасне обстеження є запорукою ефективної профілактики та
                    лікування!
                </section>
                <article className={styles.safety}>
                    <h2>Чи є процедура безпечною?</h2>
                    <ul className={styles.list}>
                        <li>
                            Для забезпечення безпеки діагностики в наших клініках застосовуються сучасні
                            анестезіологічні протоколи, які практично виключають можливість побічних ефектів
                            від наркозу.
                        </li>
                        <li>Використовувані цифрові рентген-апарати дозволяють мінімізувати променеве навантаження на тварину.</li>
                        <li>
                            Перед обстеженням власник отримує повну інформацію про підготовку улюбленця до процедури, а також
                            про особливості догляду після неї.
                        </li>
                        <li>Ми прагнемо забезпечити безпеку та комфорт як тварині, так і її власнику.</li>
                    </ul>
                </article>
                <hr />
                <article className={styles.procedure}>
                    <h2>Як проводиться діагностика?</h2>
                    <ol className={styles.procedure__items}>
                        <li><span>1</span>Спочатку ветеринар проводить зовнішній огляд тварини та виконує клінічні тести на рухливість суглобів.</li>
                        <li><span>2</span>Тварину вводять у стан легкої седації. Без заспокійливого рентгенографія кульшових суглобів не проводиться, оскільки це необхідно для отримання точних знімків.</li>
                        <li><span>3</span>Проводиться рентгенографія в стандартній позиції 1, за потреби — в позиції 2. Сама процедура займає від 5 до 15 хвилин, після чого тварина швидко виходить зі стану седації.</li>
                        <li><span>4</span>Після отримання знімків проводиться їх аналіз з розрахунком кутів та інших параметрів, що дозволяють визначити наявність дисплазії.</li>
                        <li><span>5</span>Видається детальний висновок про стан суглобів та рекомендації щодо подальших дій.</li>
                    </ol>
                </article>
                <article className={styles.expertise}>
                    <Image src={'/tbs-x-ray.jpg'} alt='x-ray for dog' width={200} height={200} />
                    <div className={styles.description}>
                        <div className={styles.expertise__head}>
                            <h2>Експертиза з видачею міжнародного сертифіката</h2>
                            <svg viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg">
                                <path d="M51.129,3H8A5,5,0,0,0,3,8v5H13V59H57V8.871A5.87,5.87,0,0,0,51.129,3Z" fill="#d9dae2" />
                                <path d="M51.129,3H8A5,5,0,0,0,3,8v5H13V59h0A44,44,0,0,0,57,15V8.871A5.87,5.87,0,0,0,51.129,3Z" fill="#e5e6eb" />
                                <polygon points="49 44 37 56 41 56 41 61 49 53 57 61 57 55 61 55 49 44" fill="#0468ad" />
                                <rect height="2" fill="#444" width="30" x="20" y="19" />
                                <rect height="2" fill="#444" width="30" x="20" y="25" />
                                <rect height="2" fill="#444" width="30" x="20" y="31" />
                                <rect height="2" fill="#444" width="30" x="20" y="37" />
                                <circle cx="35" cy="12" r="3" fill="#fff" />
                                <path d="M8,3H8a5,5,0,0,1,5,5v5a0,0,0,0,1,0,0H3a0,0,0,0,1,0,0V8A5,5,0,0,1,8,3Z" fill="#cfcfd9" />
                                <circle cx="49" cy="49" r="6" fill="#027de5" />
                                <circle cx="49" cy="49" r="4" fill="#cceaff" />
                                <polygon points="44 58 42 60 56 60 54 58 44 58" />
                                <path d="M51.129,2H8A6.006,6.006,0,0,0,2,8v5a1,1,0,0,0,1,1h9V59a1,1,0,0,0,1,1H41V58H14V8a5.969,5.969,0,0,0-1.54-4H51.129A4.877,4.877,0,0,1,56,8.871V50.417l2,1.833V8.871A6.878,6.878,0,0,0,51.129,2ZM12,12H4V8a4,4,0,0,1,8,0Z" />
                                <rect height="2" width="30" x="20" y="19" />
                                <rect height="2" width="30" x="20" y="25" />
                                <rect height="2" width="30" x="20" y="31" />
                                <rect height="2" width="30" x="20" y="37" />
                                <path d="M39,12a4,4,0,1,0-4,4A4,4,0,0,0,39,12Zm-6,0a2,2,0,1,1,2,2A2,2,0,0,1,33,12Z" />
                            </svg>
                        </div>
                        <p>
                            Для собак, що беруть участь у розведенні, особливо великих і гігантських порід,
                            можливо проходження офіційної експертизи на дисплазію з видачею міжнародного
                            сертифіката.
                        </p>
                    </div>
                </article>
                <hr />
                <article className={styles.process}>
                    <ul className={styles.process__list}>
                        <h2>Порядок проведення експертизи:</h2>
                        <li>Тварина повинна бути ідентифікована (чіпування або тавро);</li>
                        <li>Мінімальний вік для більшості порід — 12 місяців; для великих і гігантських — 18 місяців;</li>
                        <li>Власник подає заявку на сайті Білоруського кінологічного об’єднання (БКО), яка отримує унікальний номер;</li>
                        <li>Заявка засвідчується клубом, членом якого є власник, і підписується;</li>
                        <li>На підставі заявки видається направлення на експертизу;</li>
                        <li>Під час проведення експертизи експерт особисто звіряє реєстраційні дані тварини та проводить рентгенографію;</li>
                        <li>Діагностичні результати оцінюються за класифікацією FCI;</li>
                        <li>На підставі оцінки заповнюється офіційний бланк, підписаний експертом і засвідчений печаткою;</li>
                        <li>Сертифікат з результатами може бути використаний для внесення даних у родовід;</li>
                        <li>Копія сертифіката та знімки зберігаються в електронній базі не менше 5 років.</li>
                    </ul>
                </article>
            </div>
            <span className={styles.banner}>
                <p>
                    Якщо ви хочете отримати детальну інформацію або записатися на діагностику
                    та експертизу кульшових суглобів — телефонуйте нам → (094) 917-33-80,<br />
                    або відвідайте нашу клініку.
                </p>
            </span>
        </div>
    )
}

export default DiagnosticsTbs;