import Image from 'next/image';
import styles from './diagnostics-tbs.module.css';

const DiagnosticsTbs = () => {

    const svgMarker = (<svg width="16" height="16" viewBox="0 0 16 16" fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path d="M13.3346 4L6.0013 11.3333L2.66797 8" stroke="currentColor"
            strokeWidth="2" strokeLinecap="round" strokeLinejoin="round">
        </path>
    </svg>);

    return (
        <div className={styles.wrap}>
            <div className={styles.content}>
                <div className={styles.head}>
                    <Image src={'/dog1.jpg'} width={1500} height={100} alt='dog1' />
                    <h1>Діагностика та оцінка дисплазії тазостегнових суглобів (ТБС)</h1>
                    <p>
                        У нашій ветеринарній клініці проводиться всебічна діагностика дисплазії
                        кульшових суглобів (HIP), що включає як клінічні тести, так і сучасні методи
                        візуалізації. Дослідження охоплює тест Ортолані з визначенням кута вправлення
                        (кут Ортолані), а також тест Барлоу (кут повторного вивиху), що доповнюється
                        рентгенографією кульшових суглобів у різних проекціях. Цю процедуру проводить
                        сертифікований експерт кінологічного об'єднання – Ушаков Федір Олегович. В рамках
                        діагностики також можливе обстеження ліктьових суглобів.
                    </p>
                </div>
                <article className={styles.recomendation}>
                    <div className={styles.recomendation_head}>
                        <h2>Кому рекомендовано обстеження?</h2>
                        <h3>Обстеження показане:</h3>
                    </div>
                    <div className={styles.recomendation_all_lists}>
                        <div>
                            <b>Усім собакам великих і гігантських порід:</b>
                            <ul>
                                <li>{svgMarker}У віці до 4 місяців;</li>
                                <li>{svgMarker}А також у віці від 12 до 18 місяців;</li>
                            </ul>
                        </div>
                        <div>
                            <b>Представникам будь-яких порід за наявності клінічних ознак:</b>
                            <ul>
                                <li>{svgMarker}Неправильне положення тазових кінцівок;</li>
                                <li>{svgMarker}Ускладнення при лежанні на животі з розведеними в сторони задніми лапами (поза "жабки");</li>
                                <li>{svgMarker}Зниження рухової активності;</li>
                                <li>{svgMarker}Кульгавість, що посилюється після фізичних навантажень;</li>
                                <li>{svgMarker}Атипова хода: хиткість, "стрибкоподібні" рухи або "заячий біг" — одночасний поштовх обома задніми лапами;</li>
                                <li>{svgMarker}Труднощі при вставанні з положення лежачи;</li>
                                <li>{svgMarker}Неможливість стрибати;</li>
                                <li>{svgMarker}Проблеми зі спуском і підйомом сходами.</li>
                            </ul>
                        </div>
                        <div>
                            <b>Усім собакам, які плануються до племінної роботи:</b>
                            <ul>
                                <li>{svgMarker}Великі породи старше 12 місяців;</li>
                                <li>{svgMarker}Гігантські породи старше 18 місяців — згідно з регламентом FCI.</li>
                            </ul>
                        </div>
                    </div>
                </article>
                <span className={styles.note}>
                    <b>Важливо пам’ятати:</b> дисплазія кульшових суглобів може розвиватися у собаки в
                    будь-якому віці, і своєчасне обстеження є запорукою ефективної профілактики та
                    лікування!
                </span>
                <article>
                    <h2>Чи є процедура безпечною?</h2>
                    <p className={styles.list}>
                        Для забезпечення безпеки діагностики в наших клініках застосовуються сучасні
                        анестезіологічні протоколи, які практично виключають можливість побічних ефектів
                        від наркозу.
                        Використовувані цифрові рентген-апарати дозволяють мінімізувати променеве навантаження на тварину.
                        Перед обстеженням власник отримує повну інформацію про підготовку улюбленця до процедури, а також
                        про особливості догляду після неї.
                        Ми прагнемо забезпечити безпеку та комфорт як тварині, так і її власнику.
                    </p>
                </article>
                <article className={styles.procedure}>
                    <h2>Як проводиться діагностика?</h2>
                    <ol className={styles.procedure__items}>
                        <li><span>1</span>Спочатку ветеринар проводить зовнішній огляд тварини та виконує клінічні тести на рухливість суглобів.</li>
                        <li><span>2</span>Тварину вводять у стан легкої седації. Без заспокійливого рентгенографія кульшових суглобів не проводиться, оскільки це необхідно для отримання точних знімків.</li>
                        <li><span>3</span>Проводиться рентгенографія в стандартній позиції 1, за потреби — в позиції 2. Сама процедура займає від 5 до 15 хвилин, після чого тварина швидко виходить зі стану седації.</li>
                        <li><span>4</span>Після отримання знімків проводиться їх аналіз з розрахунком кутів та інших параметрів, що дозволяють визначити наявність дисплазії.</li>
                        <li><span>5</span>Видається детальний висновок про стан суглобів та рекомендації щодо подальших дій.</li>
                    </ol>
                </article>
                <h2>Експертиза з видачею міжнародного сертифіката</h2>
                <p className={styles.list}>
                    Для собак, що беруть участь у розведенні, особливо великих і гігантських порід,
                    можливо проходження офіційної експертизи на дисплазію з видачею міжнародного
                    сертифіката.
                </p>
                <ul className={styles.list}>
                    <b>Цілі експертизи:</b>
                    <li>Забезпечення контролю та якості племінного розведення;</li>
                    <li>Селекція особин з гарною анатомією суглобів.</li>
                </ul>
                <ul className={styles.list}>
                    <b>Порядок проведення експертизи:</b>
                    <li>Тварина повинна бути ідентифікована (чіпування або тавро);</li>
                    <li>Мінімальний вік для більшості порід — 12 місяців; для великих і гігантських — 18 місяців;</li>
                    <li>Власник подає заявку на сайті Білоруського кінологічного об’єднання (БКО), яка отримує унікальний номер;</li>
                    <li>Заявка засвідчується клубом, членом якого є власник, і підписується;</li>
                    <li>На підставі заявки видається направлення на експертизу;</li>
                    <li>Під час проведення експертизи експерт особисто звіряє реєстраційні дані тварини та проводить рентгенографію;</li>
                    <li>Діагностичні результати оцінюються за класифікацією FCI;</li>
                    <li>На підставі оцінки заповнюється офіційний бланк, підписаний експертом і засвідчений печаткою;</li>
                    <li>Сертифікат з результатами може бути використаний для внесення даних у родовід;</li>
                    <li>Копія сертифіката та знімки зберігаються в електронній базі не менше 5 років.</li>
                </ul>
            </div>
            <span className={styles.banner}>
                <p>
                    Якщо ви хочете отримати детальну інформацію або записатися на діагностику
                    та експертизу кульшових суглобів — телефонуйте нам → (094) 917-33-80,<br />
                    або відвідайте нашу клініку.
                </p>
            </span>
        </div>
    )
}

export default DiagnosticsTbs;