import styles from './diagnostics-tbs.module.css';

const DiagnosticsTbs = () => {
    return (
        <div className={styles.wrap}>
            <h1>Діагностика та оцінка дисплазії тазостегнових суглобів (ТБС)</h1>
            <p>
                У нашій ветеринарній клініці проводиться всебічна діагностика дисплазії
                кульшових суглобів (HIP), що включає як клінічні тести, так і сучасні методи
                візуалізації. Дослідження охоплює тест Ортолані з визначенням кута вправлення
                (кут Ортолані), а також тест Барлоу (кут повторного вивиху), що доповнюється
                рентгенографією кульшових суглобів у різних проекціях. Цю процедуру проводить
                сертифікований експерт кінологічного об'єднання – Ушаков Федір Олегович. В рамках
                діагностики також можливе обстеження ліктьових суглобів.
            </p>
            <h2>Кому рекомендовано обстеження?</h2>
            <h3>Обстеження показане:</h3>
            <ol>
                <li>
                    Усім собакам великих і гігантських порід:
                    <ul>
                        <li>У віці до 4 місяців;</li>
                        <li>А також у віці від 12 до 18 місяців;</li>
                    </ul>
                </li>
                <li>
                    Представникам будь-яких порід за наявності клінічних ознак:
                    <ul>
                        <li>Неправильне положення тазових кінцівок;</li>
                        <li>Ускладнення при лежанні на животі з розведеними в сторони задніми лапами (поза "жабки");</li>
                        <li>Зниження рухової активності;</li>
                        <li>Кульгавість, що посилюється після фізичних навантажень;</li>
                        <li>Атипова хода: хиткість, "стрибкоподібні" рухи або "заячий біг" — одночасний поштовх обома задніми лапами;</li>
                        <li>Труднощі при вставанні з положення лежачи;</li>
                        <li>Неможливість стрибати;</li>
                        <li>Проблеми зі спуском і підйомом сходами.</li>
                    </ul>
                </li>
                <li>
                    Усім собакам, які плануються до племінної роботи:
                    <ul>
                        <li>Великі породи старше 12 місяців;</li>
                        <li>Гігантські породи старше 18 місяців — згідно з регламентом FCI.</li>
                    </ul>
                </li>
            </ol>
            <span>
                <b>Важливо пам’ятати:</b> дисплазія кульшових суглобів може розвиватися у собаки в
                будь-якому віці, і своєчасне обстеження є запорукою ефективної профілактики та
                лікування!
            </span>
            <hr />
            <h3>Як проводиться діагностика?</h3>
            <ol>
                <li>Спочатку ветеринар проводить зовнішній огляд тварини та виконує клінічні тести на рухливість суглобів.</li>
                <li>Тварину вводять у стан легкої седації. Без заспокійливого рентгенографія кульшових суглобів не проводиться, оскільки це необхідно для отримання точних знімків.</li>
                <li>Проводиться рентгенографія в стандартній позиції 1, за потреби — в позиції 2. Сама процедура займає від 5 до 15 хвилин, після чого тварина швидко виходить зі стану седації.</li>
                <li>Після отримання знімків проводиться їх аналіз з розрахунком кутів та інших параметрів, що дозволяють визначити наявність дисплазії.</li>
                <li>Видається детальний висновок про стан суглобів та рекомендації щодо подальших дій.</li>
            </ol>
            <hr />
            <h3>Чи є процедура безпечною?</h3>
            <p>
                Для забезпечення безпеки діагностики в наших клініках застосовуються сучасні
                анестезіологічні протоколи, які практично виключають можливість побічних ефектів
                від наркозу.
                Використовувані цифрові рентген-апарати дозволяють мінімізувати променеве навантаження на тварину.
                Перед обстеженням власник отримує повну інформацію про підготовку улюбленця до процедури, а також
                про особливості догляду після неї.
                Ми прагнемо забезпечити безпеку та комфорт як тварині, так і її власнику.
            </p>
            <hr />
            <h3>Експертиза з видачею міжнародного сертифіката</h3>
            <p>
                Для собак, що беруть участь у розведенні, особливо великих і гігантських порід,
                можливо проходження офіційної експертизи на дисплазію з видачею міжнародного
                сертифіката.
            </p>
            <ul>
                <b>Цілі експертизи:</b>
                <li>Забезпечення контролю та якості племінного розведення;</li>
                <li>Селекція особин з гарною анатомією суглобів.</li>
            </ul>
            <ul>
                <b>Порядок проведення експертизи:</b>
                <li>Тварина повинна бути ідентифікована (чіпування або тавро);</li>
                <li>Мінімальний вік для більшості порід — 12 місяців; для великих і гігантських — 18 місяців;</li>
                <li>Власник подає заявку на сайті Білоруського кінологічного об’єднання (БКО), яка отримує унікальний номер;</li>
                <li>Заявка засвідчується клубом, членом якого є власник, і підписується;</li>
                <li>На підставі заявки видається направлення на експертизу;</li>
                <li>Під час проведення експертизи експерт особисто звіряє реєстраційні дані тварини та проводить рентгенографію;</li>
                <li>Діагностичні результати оцінюються за класифікацією FCI;</li>
                <li>На підставі оцінки заповнюється офіційний бланк, підписаний експертом і засвідчений печаткою;</li>
                <li>Сертифікат з результатами може бути використаний для внесення даних у родовід;</li>
                <li>Копія сертифіката та знімки зберігаються в електронній базі не менше 5 років.</li>
            </ul>
            <hr />
            <b>
                Якщо ви хочете отримати детальну інформацію або записатися на діагностику
                та експертизу кульшових суглобів — зв’яжіться з нами за телефоном, вказаним на сайті,
                або відвідайте нашу клініку.
            </b>
        </div>
    )
}

export default DiagnosticsTbs;